lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb_device.c
                    /* Prepare EP0 for next setup */
                    if ((usbdh->epIN[epNum].bufLen == 0) && \
                            (epNum == USBD_EP_0))
                    {
                        /* prepare to receive next setup packets */
                        USBD_EP0_OutHandler(usbdh, usbdh->usbCfg.dmaStatus, (uint8_t*)usbdh->setup);
                    }
                }

                /* Callback DATA IN stage */
                USBD_DataInStageCallback(usbdh, epNum);
            }

            /* Timeout */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_TO))
            {
                USB_OTG_D_ClearInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_TO);
            }

            /* IN token received when TxFIFO is empty */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_ITXEMP))
            {
                USB_OTG_D_ClearInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_ITXEMP);
            }

            /* IN endpoint NAK effective */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_IEPNAKE))
            {
                USB_OTG_D_ClearInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_IEPNAKE);
            }

            /* Endpoint disabled */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_EPDIS))
            {
                USB_OTG_D_ClearInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_EPDIS);
            }

            /* TxFIFO empty */
            if (USB_OTG_D_ReadInEpIntStatus(usbdh->usbDevice, epNum, USBD_INT_EP_IN_TXFE))
            {
                USBD_EP_PushDataEmptyTxFifo(usbdh, epNum);
            }
        }
    }
}

/*!
 * @brief       Handle USB Resume interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_ResumeIsrHandler(USBD_HANDLE_T* usbdh)
{
    USB_OTG_D_DisableRemoteWakeupSignal(usbdh->usbDevice);

    /* Add LP mode handle */

    /* Resume Callback */
    USBD_ResumeCallback(usbdh);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_RWAKE);
}

/*!
 * @brief       Handle USB Suspend interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_SuspendIsrHandler(USBD_HANDLE_T* usbdh)
{
    if (usbdh->usbDevice->DSTS_B.SUSSTS)
    {
        /* Suspend Callback */
        USBD_SuspendCallback(usbdh);
    }

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_USBSUS);
}

/*!
 * @brief       Handle USB Reset interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_ResetIsrHandler(USBD_HANDLE_T* usbdh)
{
    uint8_t i;

    USB_OTG_D_DisableRemoteWakeupSignal(usbdh->usbDevice);

    /* Flush all Tx FIFOs */
    USB_OTG_FlushTxFIFO(usbdh->usbGlobal, 0x10);

    /* Init endpoint */
    for (i = 0; i < usbdh->usbCfg.devEndpointNum; i++)
    {
        /* Set OUT endpoint */
        usbdh->usbDevice->EP_OUT[i].DOEPCTRL_B.STALLH = BIT_RESET;
        usbdh->usbDevice->EP_OUT[i].DOEPCTRL_B.NAKSET = BIT_SET;

        /* Clear endpoint Flag */
        usbdh->usbDevice->EP_OUT[i].DOEPINT = 0xFB7F;

        /* Set IN endpoint */
        usbdh->usbDevice->EP_IN[i].DIEPCTRL_B.STALLH = BIT_RESET;
        usbdh->usbDevice->EP_IN[i].DIEPCTRL_B.NAKSET = BIT_SET;

        /* Clear endpoint Flag */
        usbdh->usbDevice->EP_IN[i].DIEPINT = 0xFB7F;
    }

    /* Enable enpoint 0 global interrupt */
    USB_OTG_D_EnableOutEpInterruptMask(usbdh->usbDevice, USBD_EP_0);
    USB_OTG_D_EnableInEpInterruptMask(usbdh->usbDevice, USBD_EP_0);

    /* Only use in HS */
    if (usbdh->usbCfg.ep1Status == ENABLE)
    {
        /* IN EP1 */
        USB_OTG_D_EnableInEp1Interrupt(usbdh->usbDevice, \
                                       USBD_INT_EP_IN_TSFCMP    |
                                       USBD_INT_EP_IN_EPDIS     |
                                       USBD_INT_EP_IN_TO);



        /* OUT EP1 */
        USB_OTG_D_EnableOutEp1Interrupt(usbdh->usbDevice, \
                                        USBD_INT_EP_OUT_TSFCMP  |
                                        USBD_INT_EP_OUT_EPDIS   |
                                        USBD_INT_EP_OUT_SETPCMP);
    }
    else
    {
        /* IN EP */
        USB_OTG_D_EnableInEpInterrupt(usbdh->usbDevice, \
                                      USBD_INT_EP_IN_TSFCMP |
                                      USBD_INT_EP_IN_EPDIS  |
                                      USBD_INT_EP_IN_TO);

        /* OUT EP */
        USB_OTG_D_EnableOutEpInterrupt(usbdh->usbDevice, \
                                       USBD_INT_EP_OUT_TSFCMP   |
                                       USBD_INT_EP_OUT_EPDIS    |
                                       USBD_INT_EP_OUT_SETPCMP  |
                                       USBD_INT_EP_OUT_RXOTPR   |
                                       USBD_INT_EP_OUT_NAK);
    }

    /* Set device address to 0 */
    USB_OTG_D_ConfigDeviceAddress(usbdh->usbDevice, (0x00 & 0x7F));

    /* setup EP0 to receive SETUP packet */
    USBD_EP0_OutHandler(usbdh, usbdh->usbCfg.dmaStatus, (uint8_t*)usbdh->setup);

    /* Clear interrupt */
    USB_OTG_ClearGlobalIntFlag(usbdh->usbGlobal, USB_INT_G_USBRST);
}

/*!
 * @brief       Handle USB Enum Done interrupt
 *
 * @param       usbdh: USB device handler.
 *
 * @retval      None
 */
static void USBD_EnumDoneIsrHandler(USBD_HANDLE_T* usbdh)
{
    uint32_t enumSpeed;

    /* Active EP0 for SETUP */
    usbdh->usbDevice->EP_IN[0].DIEPCTRL_B.MAXPS = USDB_EP0_MAXPS_64_BYTES;

    /* Clear all NAK */
    usbdh->usbDevice->DCTRL_B.GINAKCLR = BIT_SET;

    /* Store USB device speed */
    enumSpeed = USB_OTG_D_ReadEnumSpeed(usbdh->usbDevice);

    switch (enumSpeed)
    {
        case USBD_ENUM_SPEED_HS:
            usbdh->usbCfg.speed = USB_OTG_SPEED_HSFSLS;
            break;

        case USBD_ENUM_SPEED_HS_IN_FS:
        case USBD_ENUM_SPEED_FS:
            usbdh->usbCfg.speed = USB_OTG_SPEED_FSLS;
            break;

        default:
            /* Speed error status */
            usbdh->usbCfg.speed = 0xFF;
            break;
    }

    /* Set turnaround time */
    USB_OTG_SetTurnaroundTime(usbdh->usbGlobal, RCM_ReadHCLKFreq(), usbdh->usbCfg.speed);

    USBD_EnumDoneCallback(usbdh);

